Masmiseim36/nxpSDK/boards/evkbmimxrt1170/usb_examples/usb_device_cdc_ecm_nic_lite/bm/cm7/pin_mux.h
/* GPIO_DISP_B1_11 (coord A14), ENET_RGMII_TXC/U10[20]/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXC_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXC_SIGNAL               enet_tx_clk_io   /*!< Signal name */

/* GPIO_DISP_B1_09 (coord C13), ENET_RGMII_TXD0/U10[18]/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD0_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD0_SIGNAL                  enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD0_CHANNEL                         0U   /*!< Signal channel */

/* GPIO_DISP_B1_08 (coord A15), ENET_RGMII_TXD1/U10[17]/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD1_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD1_SIGNAL                  enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD1_CHANNEL                         1U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord E12), ENET_RGMII_TXD2/U10[16]/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD2_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD2_SIGNAL                  enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD2_CHANNEL                         2U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord D10), ENET_RGMII_TXD3/U10[15]/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD3_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD3_SIGNAL                  enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_TXD3_CHANNEL                         3U   /*!< Signal channel */

/* GPIO_DISP_B2_13 (coord A5), INT1_COMBO/BT_UART_RTS/U354[5]/ETHPHY_RST_B/U10[12] */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_PERIPHERAL                      GPIO11   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_CHANNEL                            14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_GPIO                            GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_GPIO_PIN                           14U   /*!< GPIO pin number */
#define BOARD_INITENET_1GPINS_BT_UART_RTS_GPIO_PIN_MASK              (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_MDC_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_MDC_SIGNAL                     enet_mdc   /*!< Signal name */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_RGMII_MDIO_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_RGMII_MDIO_SIGNAL                   enet_mdio   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET_1GPins(void);             /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
